#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.cert.fastly_tls_subscription.subscription: Refreshing state... [id=hFR0AkVDgg3aAxPpmZACfQ]
module.cert.aws_route53_record.domain_validation[1]: Refreshing state... [id=Z09746811FRPQHUTQ7HK2__acme-challenge.tfdemo-stage.hkakehas.tokyo_CNAME]
module.cert.aws_route53_record.domain_validation[0]: Refreshing state... [id=Z09746811FRPQHUTQ7HK2__acme-challenge.tfdemo-prod.hkakehas.tokyo_CNAME]
module.cert.fastly_tls_subscription_validation.validation: Refreshing state... [id=hFR0AkVDgg3aAxPpmZACfQ]
module.cert.aws_route53_record.records["tfdemo-prod.hkakehas.tokyo"]: Refreshing state... [id=Z09746811FRPQHUTQ7HK2_tfdemo-prod.hkakehas.tokyo_CNAME]
module.cert.aws_route53_record.records["tfdemo-stage.hkakehas.tokyo"]: Refreshing state... [id=Z09746811FRPQHUTQ7HK2_tfdemo-stage.hkakehas.tokyo_CNAME]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.cert.aws_route53_record.domain_validation[0] has been deleted
  - resource "aws_route53_record" "domain_validation" {
      - allow_overwrite = true -> null
      - fqdn            = "_acme-challenge.tfdemo-prod.hkakehas.tokyo" -> null
      - id              = "Z09746811FRPQHUTQ7HK2__acme-challenge.tfdemo-prod.hkakehas.tokyo_CNAME" -> null
      - name            = "_acme-challenge.tfdemo-prod.hkakehas.tokyo" -> null
      - records         = [
          - "yfxsysk4zic9zk71tt.fastly-validations.com",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z09746811FRPQHUTQ7HK2" -> null
    }

  # module.cert.aws_route53_record.domain_validation[1] has been deleted
  - resource "aws_route53_record" "domain_validation" {
      - allow_overwrite = true -> null
      - fqdn            = "_acme-challenge.tfdemo-stage.hkakehas.tokyo" -> null
      - id              = "Z09746811FRPQHUTQ7HK2__acme-challenge.tfdemo-stage.hkakehas.tokyo_CNAME" -> null
      - name            = "_acme-challenge.tfdemo-stage.hkakehas.tokyo" -> null
      - records         = [
          - "o5wwyt8t3ahj8vq3un.fastly-validations.com",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z09746811FRPQHUTQ7HK2" -> null
    }

  # module.cert.aws_route53_record.records["tfdemo-prod.hkakehas.tokyo"] has been deleted
  - resource "aws_route53_record" "records" {
      - allow_overwrite = true -> null
      - fqdn            = "tfdemo-prod.hkakehas.tokyo" -> null
      - id              = "Z09746811FRPQHUTQ7HK2_tfdemo-prod.hkakehas.tokyo_CNAME" -> null
      - name            = "tfdemo-prod.hkakehas.tokyo" -> null
      - records         = [
          - "m.sni.global.fastly.net",
        ] -> null
      - ttl             = 300 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z09746811FRPQHUTQ7HK2" -> null
    }

  # module.cert.aws_route53_record.records["tfdemo-stage.hkakehas.tokyo"] has been deleted
  - resource "aws_route53_record" "records" {
      - allow_overwrite = true -> null
      - fqdn            = "tfdemo-stage.hkakehas.tokyo" -> null
      - id              = "Z09746811FRPQHUTQ7HK2_tfdemo-stage.hkakehas.tokyo_CNAME" -> null
      - name            = "tfdemo-stage.hkakehas.tokyo" -> null
      - records         = [
          - "m.sni.global.fastly.net",
        ] -> null
      - ttl             = 300 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z09746811FRPQHUTQ7HK2" -> null
    }

  # module.cert.fastly_tls_subscription.subscription has changed
  ~ resource "fastly_tls_subscription" "subscription" {
      + certificate_id          = "0CLsF11Efu42eER6fbSCDR"
        id                      = "hFR0AkVDgg3aAxPpmZACfQ"
      ~ state                   = "pending" -> "issued"
      ~ updated_at              = "2022-05-04T16:34:00Z" -> "2022-09-01T15:48:02Z"
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cert.aws_route53_record.domain_validation[0] will be created
  + resource "aws_route53_record" "domain_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0847082RI532A0NWHJN"
    }

  # module.cert.aws_route53_record.domain_validation[1] will be created
  + resource "aws_route53_record" "domain_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0847082RI532A0NWHJN"
    }

  # module.cert.aws_route53_record.records["tfdemo-prod.hrmsk66.com"] will be created
  + resource "aws_route53_record" "records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "tfdemo-prod.hrmsk66.com"
      + records         = [
          + "m.sni.global.fastly.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z0847082RI532A0NWHJN"
    }

  # module.cert.aws_route53_record.records["tfdemo-stage.hrmsk66.com"] will be created
  + resource "aws_route53_record" "records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "tfdemo-stage.hrmsk66.com"
      + records         = [
          + "m.sni.global.fastly.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z0847082RI532A0NWHJN"
    }

  # module.cert.fastly_tls_subscription.subscription will be updated in-place
  ~ resource "fastly_tls_subscription" "subscription" {
      ~ domains                 = [
          - "tfdemo-prod.hkakehas.tokyo",
          + "tfdemo-prod.hrmsk66.com",
          - "tfdemo-stage.hkakehas.tokyo",
          + "tfdemo-stage.hrmsk66.com",
        ]
        id                      = "hFR0AkVDgg3aAxPpmZACfQ"
      ~ managed_dns_challenges  = [
          - {
              - record_name  = "_acme-challenge.tfdemo-prod.hkakehas.tokyo"
              - record_type  = "CNAME"
              - record_value = "yfxsysk4zic9zk71tt.fastly-validations.com"
            },
          - {
              - record_name  = "_acme-challenge.tfdemo-stage.hkakehas.tokyo"
              - record_type  = "CNAME"
              - record_value = "o5wwyt8t3ahj8vq3un.fastly-validations.com"
            },
        ] -> (known after apply)
      ~ managed_http_challenges = [
          - {
              - record_name   = "tfdemo-prod.hkakehas.tokyo"
              - record_type   = "A"
              - record_values = [
                  - "151.101.1.55",
                  - "151.101.129.55",
                  - "151.101.193.55",
                  - "151.101.65.55",
                ]
            },
          - {
              - record_name   = "tfdemo-prod.hkakehas.tokyo"
              - record_type   = "CNAME"
              - record_values = [
                  - "m.sni.global.fastly.net",
                ]
            },
          - {
              - record_name   = "tfdemo-stage.hkakehas.tokyo"
              - record_type   = "A"
              - record_values = [
                  - "151.101.1.55",
                  - "151.101.129.55",
                  - "151.101.193.55",
                  - "151.101.65.55",
                ]
            },
          - {
              - record_name   = "tfdemo-stage.hkakehas.tokyo"
              - record_type   = "CNAME"
              - record_values = [
                  - "m.sni.global.fastly.net",
                ]
            },
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ domains = [
      - "tfdemo-prod.hkakehas.tokyo",
      + "tfdemo-prod.hrmsk66.com",
      - "tfdemo-stage.hkakehas.tokyo",
      + "tfdemo-stage.hrmsk66.com",
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @hrmsk66, Action: `pull_request`, Working Directory: `global/cert`, Workflow: `Deploy cert`*